app/controllers/movies_controller.rb

  def index
    redirect = false

    if params[:sort]
      @sort = params[:sort]
    elsif session[:sort]
      @sort = session[:sort]
      redirect = true
    end

    @all_ratings = Movie.all_ratings
    @ratings = { }

    if params[:ratings]
      @ratings = params[:ratings]
    elsif session[:ratings]
      @ratings = session[:ratings]
      redirect = true
    else
      @all_ratings.each do |rate|
---
SELECT "movies".* FROM "movies" ORDER BY release_date